Repository: 84000/data-translation-memory
Catalog: toh68_84000-ascertaining-the-vinaya-upali-s-questions.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་འདི་བསྟན་པ་འགའ་ཞིག་ལེགས་པར་སྟོན་པར་མཛད་དུ་གསོལ།
en: Bhagavān, for that reason, please have Youthful Mañjuśrī teach some of the important points.” The Bhagavān said to Youthful Mañjuśrī, “Mañjuśrī, because the monk Upāli wishes to hear about mastering the Vinaya, give a teaching beginning with the topic of the thoroughly tamed

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །འཇམ་དཔལ་དགེ་སློང་ཉེ་བར་འཁོར་འདི་འདུལ་བ་ལ་མཁས་པ་ཉན་པར་འདོད་ཀྱིས་ཤིན་ཏུ་དུལ་བ་ལས་རྩོམས་ཏེ་ཁྱོད་སློབས་པར་གྱིས་ཤིག །དེ་ནས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་ཉེ་བར་འཁོར་ཆོས་ཐམས་ཅད་ནི་ཤིན་ཏུ་དུལ་བ་སྟེ། རང་གི་སེམས་གདུལ་བའི་ཕྱིར་ཤིན་ཏུ་དུལ་བ་ཀུན་ཏུ་སྟོན་ཏོ།
en: Then Youthful Mañjuśrī said to the venerable Upāli, “Honorable Upāli, all phenomena are thoroughly tamed—it is for the sake of disciplining one’s own mind that the topic of the thoroughly tamed is taught.

source: །ཆོས་ཐམས་ཅད་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་པ་སྟེ་བདག་མི་དམིགས་པའི་ཕྱིར་འགྱོད་པ་འདུལ་བ་ཀུན་ཏུ་སྟོན་ཏོ།
en: No phenomenon is defiled; it is because the self cannot be apprehended that the discipline of remorse is taught.

source: །ཆོས་ཐམས་ཅད་ནི་ཕྱིན་ཅི་མ་ལོག་པ་སྟེ།
en: No phenomenon is mistaken;

source: རང་བཞིན་གྱིས་ཡོངས་སུ་དག་པའི་ཕྱིར་ཤིན་ཏུ་དུལ་བ་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because they are inherently pure that the topic of the thoroughly tamed is taught.

source: །ཆོས་ཐམས་ཅད་ནི་དེ་བཞིན་ཉིད་ཀྱི་མཐའི་སྒོ་ཡིན་ཏེ།
en: All phenomena are an ultimate gateway to suchness;

source: བསླབ་པ་ལ་རློམ་སེམས་མེད་པར་བྱ་བའི་ཕྱིར་བསླབ་པ་ཡོངས་སུ་དག་པ་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because training should be free of deceit that pure training is taught.

source: །ཆོས་ཐམས་ཅད་ནི་རྣམ་པར་མི་རྟོག་པ་དང་། བླང་བ་མེད་པ་དང་། དོར་བ་མེད་པ་སྟེ་བསམ་གྱིས་མི་ཁྱབ་པས་ཆགས་པ་མེད་པ་ཉིད་ཀུན་ཏུ་སྟོན་ཏོ།
en: All phenomena are nonconceptual, cannot be accepted, and cannot be rejected; it is because they are inconceivable that the state of nonattachment is taught.

source: །ཆོས་ཐམས་ཅད་ནི་ཆགས་པ་མེད་པ་དང་། གནས་པ་མེད་པ་སྟེ།
en: All phenomena are free of attachment and do not persist;

source: །ཡུན་རིང་དུ་མི་གནས་པའི་ཕྱིར་འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་དག་པ་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because they do not persist for long that the purity of all beings is taught.

source: །ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའི་མཐའ་ལ་གནས་པ་སྟེ།
en: All phenomena are found within the limits of space;

source: དངོས་པོ་དང་བྲལ་བའི་ཕྱིར་རང་བཞིན་མེད་པ་ཉིད་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because they lack materiality that the lack of inherent existence has been taught.

source: །ཆོས་ཐམས་ཅད་ནི་ཐ་དད་དུ་བྱ་བ་མེད་པར་གྱུར་པ་སྟེ།
en: No phenomenon can be differentiated;

source: སྔོན་གྱི་མཐའ་དང་ཕྱི་མའི་མཐའ་དང་ད་ལྟར་བྱུང་བ་མི་དམིགས་པའི་ཕྱིར་དུས་གསུམ་མཉམ་པ་ཉིད་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because the limits of past, future, and present are not apprehended that the sameness of the three times is taught.

source: །ཆོས་ཐམས་ཅད་ནི་གདགས་པ་དང་བྲལ་བ་སྟེ།
en: All phenomena lack designations;

source: སེམས་མཉམ་པ་ཉིད་དུ་སྤྱོད་པའི་ཕྱིར་ཐེ་ཚོམ་སྤང་བ་ཀུན་ཏུ་སྟོན་ཏོ།
en: it is because the mind is oriented to equanimity that the elimination of doubt is taught.

source: །བཙུན་པ་ཉེ་བར་འཁོར་དེ་ནི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱིས་རྗེས་སུ་རྟོགས་པ་ཆོས་ཀྱི་དབྱིངས་ཤིན་ཏུ་དུལ་བ་ཡིན་ཏེ།
en: “Honorable Upāli, that is the thoroughly tamed dharmadhātu realized by bhagavān buddhas.

source: རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་གང་དག་ཆོས་ཉིད་འདི་ལ་མ་མོས་པ་དེ་དག་ནི་དེ་བཞིན་གཤེགས་པའི་བསླབ་པ་ལས་རིང་དུ་གྱུར་པ་ཡིན་ནོ།
en: Noble sons and daughters who do not have faith in the true nature of phenomena are far removed from the training of the Tathāgata.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་གང་དང་གང་སྟོན་པ་དེ་དག་ཐམས་ཅད་བསམ་གྱིས་མི་ཁྱབ་པ་ཁོ་ན་ལས་བརྩམས་ཏེ་སྟོན་ལགས་སོ། །དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: Then the venerable Upāli said to the Bhagavān, “Bhagavān, the teaching that Youthful Mañjuśrī has given emerges from the inconceivable itself.”

source: །ཉེ་བར་འཁོར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པའི་ཆོས་སྟོན་པ་ནི་རྣམ་པར་གྲོལ་བའི་རྒྱུ་འཐུན་པ་ཡིན་ཏེ།
en: The Bhagavān replied to the venerable Upāli, “Upāli, the Dharma teaching of Youthful Mañjuśrī is aligned with liberation;

source: བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ལ་མ་བརྟེན་པར་རྣམ་པར་གྲོལ་བ་མེད་པས་ན།
en: there is no liberation that is not rooted in inconceivability.

source: དེའི་ཕྱིར་འཇམ་དཔལ་གཞོན་ནུར་གྱུར་པ་ནི་རྣམ་པར་རྟོག་པ་ཐམས་ཅད་དང་བྲལ་བ་དང་། སེམས་པ་ལ་མོས་པ་ལྷག་པའི་ང་རྒྱལ་ཅན་རྣམས་ཀྱི་ལྷག་པའི་ང་རྒྱལ་མེད་པར་བྱ་བའི་ཕྱིར་ཆོས་སྟོན་ཏོ།
en: For that reason Youthful Mañjuśrī teaches the Dharma for the sake of removing the arrogance of those arrogant ones who believe that they are free of all concepts but are caught up in thought.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་སེམས་གང་དང་མཚུངས་པར་ལྡན་ན་ལྷག་པའི་ང་རྒྱལ་ཅན་ལགས།
en: Then the venerable Upāli asked the Bhagavān, “Bhagavān, what thoughts do monks have that illustrate this arrogance?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཉེ་བར་འཁོར་འདི་ལ་དགེ་སློང་གལ་ཏེ་འདོད་ཆགས་སྤང་བར་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: The Bhagavān then replied to the venerable Upāli, “Upāli, if a monk thinks he has eliminated desire, then he acts with arrogance.

source: །གལ་ཏེ་ཞེ་སྡང་སྤང་བ་དང་། གཏི་མུག་སྤང་བར་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks he has eliminated anger and delusion, then he acts with arrogance.

source: །གལ་ཏེ་འདོད་ཆགས་ཀྱི་ཆོས་ཀྱང་གཞན་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་གཞན་ནོ་ཞེས་དེ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘The qualities of desire are one thing, and the qualities of a buddha are another,’ then he acts with arrogance.

source: །གལ་ཏེ་ཞེ་སྡང་གི་ཆོས་ཀྱང་གཞན་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་གཞན་པ་དང་། གཏི་མུག་གི་ཆོས་ཀྱང་གཞན་ལ་སངས་རྒྱས་ཀྱི་ཆོས་ཀྱང་གཞན་ནོ་ཞེས་དེ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘The qualities of anger are one thing and the qualities of a buddha are another,’ or ‘the qualities of delusion are one thing and the qualities of the Buddha are another,’ he acts with arrogance.

source: །གལ་ཏེ་དགའ་བ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks he is happy, he acts with arrogance.

source: །བྱ་བ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of his deeds, he acts with arrogance.

source: །རྣམ་པར་གྲོལ་བ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks he is liberated, he acts with arrogance.

source: །སྟོང་པ་ཉིད་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of emptiness, he acts with arrogance.

source: །མཚན་མ་མེད་པ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of signlessness, he acts with arrogance.

source: །སྨོན་པ་མེད་པ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of wishlessness, he acts with arrogance.

source: །མངོན་པར་འདུ་བྱ་བ་མེད་པ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of preconceived notions, he acts with arrogance.

source: །སྐྱེ་བ་མེད་པ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of nonorigination, he acts with arrogance.

source: །དངོས་པོ་མེད་པ་ལ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks of immateriality, he acts with arrogance.

source: །གལ་ཏེ་ཆོས་རྣམས་ཡོད་དོ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks that phenomena exist, he acts with arrogance.

source: །ཆོས་ཐམས་ཅད་ནི་མི་རྟག་གོ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks that all phenomena are impermanent, he acts with arrogance.

source: །ཆོས་ཐམས་ཅད་སྟོང་པ་ལ་ཡང་བྱ་བ་ཅི་ཡོད་ཅེས་དེ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ཏེ།
en: If he thinks, ‘What is there to do if all phenomena are empty?’ then he acts with arrogance.

source: དེ་ནི་ཉན་ཐོས་ཀྱི་ཐེག་པ་པའི་ལྷག་པའི་ང་རྒྱལ་ཡིན་ནོ།
en: This is the arrogance of a follower of the Śrāvakayāna.

source: །དེ་ལ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་ལྷག་པའི་ང་རྒྱལ་གང་ཞེ་ན།
en: “What is the arrogance of a follower of the Bodhisattva­yāna?

source: གལ་ཏེ་བདག་གིས་ཐམས་ཅད་ལས་ཁྱད་པར་དུ་འཕགས་པ་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ལ་སེམས་བསྐྱེད་དོ་ཞེས་དེ་སྙམ་དུ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘I have generated the attitude that aspires to the gnosis of the buddhas, which is superior to everything else,’ then he acts with arrogance.

source: །གལ་ཏེ་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པར་བྱའོ་ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘I should practice the six perfections,’ then he acts with arrogance.

source: །གལ་ཏེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བ་ཡིན་པར་སེམས་ཏེ།
en: If he thinks that the perfection of wisdom refers to renunciation, then he acts with arrogance.

source: དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ། །གལ་ཏེ་འདི་ནི་ཟབ་པའོ། །འདི་ནི་ཟབ་པ་མ་ཡིན་ནོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘This is profound, and that is not profound,’ then he acts with arrogance.

source: །གལ་ཏེ་འདིས་ནི་རྣམ་པར་དག་པར་འགྱུར་ལ་འདིས་ནི་རྣམ་པར་དག་པར་མི་འགྱུར་རོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘This leads to purity, and that does not lead to purity,’ then he acts with arrogance.

source: །གལ་ཏེ་འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་རང་སངས་རྒྱས་ཀྱི་ཆོས་སོ། །འདི་དག་ནི་ཉན་ཐོས་ཀྱི་ཆོས་སོ་ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ། །གལ་ཏེ་འདི་ནི་རིགས་སོ། །འདི་ནི་མི་རིགས་སོ།
en: If he thinks, ‘These are the qualities of buddhas, these are the qualities of pratyekabuddhas, and these are the qualities of śrāvakas,’ then he acts with arrogance.

source: །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘This is logical, and that is not logical,’ then he acts with arrogance.

source: །གལ་ཏེ་འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་ཡིན་ནོ། །འདི་ནི་ཀུན་ནས་ཉོན་མོངས་པ་ཅན་མ་ཡིན་ནོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘This is defiled, and that is not defiled,’ then he acts with arrogance.

source: །གལ་ཏེ་འདི་ནི་ལམ་ཡིན་ནོ། །འདི་ནི་ལམ་མ་ཡིན་ནོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘This is the path, and that is not the path,’ then he acts with arrogance.

source: །གལ་ཏེ་མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘I will quickly and fully attain unsurpassed, completely perfect awakening,’ then he acts with arrogance.

source: །གལ་ཏེ་ཆོས་ཐམས་ཅད་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་པས་འདི་ལ་བསམ་པར་བྱ་བ་མེད་དོ། །ཞེས་དེ་སྙམ་སེམས་ན་ལྷག་པའི་ང་རྒྱལ་ལ་སྤྱོད་པ་ཡིན་ནོ།
en: If he thinks, ‘Since all phenomena are inconceivable, I will not contemplate them,’ then he acts with arrogance.

source: །གལ་ཏེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་བསམ་གྱིས་མི་ཁྱབ་པ་ཡིན་པས་བསམ་པར་བྱ་བ་ཅི་ཡང་མེད་དོ། །ཞེས་དེ་སྙམ་སེམས་ན་དམིགས་པ་ཆེན་པོ་ཡིན་ཏེ།
en: If he thinks, ‘Since unsurpassed, completely perfect awakening is inconceivable, there is nothing to be contemplated,’ then he is engaged in significant objectification.

source: དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་ལྷག་པའི་ང་རྒྱལ་ཡིན་ནོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་གྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: This is the arrogance of a follower of the Bodhisattva­yāna.”

source: །བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན། དགེ་སློང་ལྷག་པའི་ང་རྒྱལ་མ་མཆིས་པ་ལགས།
en: Then the venerable Upāli asked the Bhagavān, “How does a monk avoid arrogance?”

source: དེ་སྐད་ཅེས་གསོལ་པ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་ཉེ་བར་འཁོར་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །ཉེ་བར་འཁོར་དགེ་སློང་གང་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཀྱི་རྒྱུ་འཐུན་པ། བསམ་གྱིས་མི་ཁྱབ་པ་ཉིད་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་ན་དེ་ནི་ཤིན་ཏུ་ལྷག་པའི་ང་རྒྱལ་མེད་པ་ཡིན་ནོ།
en: The Bhagavān replied to the venerable Upāli, “Upāli, a monk avoids arrogance if he is not attached to the causal conditions for omniscient gnosis, to the inconceivable.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་བསམ་གྱིས་མི་ཁྱབ་པ་འདི་ཉིད་རྒྱ་ཆེར་སྟོན་ཅིང་དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་བཀའ་སྩལ་ཏོ། །གང་དག་བསམ་ཡས་ཆོས་རྣམས་འདི་ཤེས་པའི།
en: Then, to explain the inconceivable in detail, the Bhagavān spoke in verse:

source: །མི་རྣམས་དེ་དག་རྟག་ཏུ་བདེ་བ་ཡིན།
en: “Always happy are those people Who understand that phenomena are inconceivable.

source: །ཆོས་དང་ཆོས་མིན་རྣམ་རྟོག་མེད་པ་སྟེ།
en: They have no concept of Dharma and non-Dharma;

source: །ཐམས་ཅད་སེམས་ཀྱི་སྤྲོས་པས་ཕྱེ་བ་ཡིན།
en: Everything is differentiated by mental elaboration.

source: །ཐམས་ཅད་བསམ་ཡས་ཐམས་ཅད་བྱུང་མིན་པས།
en: “Since everything is inconceivable and everything is unreal,

source: །དངོས་དང་དངོས་མེད་ཤེས་པ་རྣམ་པར་ཤིག །བྱིས་པ་གང་དག་སེམས་ཀྱི་དབང་སོང་བ།
en: Gnosis should discern between the existent and non-existent. But fools who have fallen under the power of mind

source: །དེ་དག་སྲིད་པ་བྱེ་བ་བརྒྱར་སྡུག་བསྔལ།
en: Suffer for billions of existences. “The Buddha is inconceivable and nonexistent;

source: །དགེ་སློང་གང་དག་བསམ་ཡས་ཡོད་མིན་པའི། །སངས་རྒྱས་མི་མཆོག་དེ་སེམས་ཚུལ་བཞིན་མིན།
en: Monks who do not consider him supreme are incorrect in their thinking.

source: །རྟོག་པའི་དབང་གིས་སངས་རྒྱས་རྣམ་པར་བརྟགས།
en: The Buddha is a product of their conceptualization,

source: །རྟོག་པ་དེ་ཡང་ནམ་ཡང་བྱུང་མ་ཡིན།
en: But even this conceptualization is unreal.

source: །གང་དག་ཆོས་རྣམས་སྟོང་ལ་སེམས་བྱེད་པའི།
en: “Fools who think that phenomena are empty

source: །བྱིས་པ་དེ་དག་ལམ་ངན་ཞུགས་པ་ཡིན།
en: Have taken a wrong path.

source: །ཆོས་རྣམས་སྟོང་པ་ཡི་གེས་བརྗོད་པ་ནི།
en: Phenomena that are declared empty with words

source: །དེ་དག་ཡི་གེ་མེད་པར་ཡི་གེས་བསྟན།
en: Are themselves wordless but expressed in words.

source: །གང་དག་ཞི་ཞིང་རབ་ཞིའི་ཆོས་སེམས་པའི།
en: “The mind that thinks phenomena are peaceful and pacified

source: །སེམས་པ་དེ་ཡང་ནམ་ཡང་བྱུང་མ་ཡིན།
en: Is itself unborn and unreal.

source: །སྤྲོས་ཀུན་སེམས་ཀྱི་རྣམ་པར་རྟོག་ཡིན་ཏེ།
en: All conceptual elaborations are postulations of the mind.

source: །དེ་ཕྱིར་ཆོས་རྣམས་བསམ་ཡས་རྟོགས་པར་གྱིས།
en: Therefore, know that phenomena are inconceivable.

source: །ཆོས་འདི་ཐམས་ཅད་སེམས་མེད་སེམས་པ་མེད།
en: “All of these phenomena are unthinkable, unimaginable;

source: །ཇི་སྲིད་མི་སེམས་དེ་སྲིད་སྟོང་པ་ཡིན།
en: To the extent they are unthought, so are they empty.

source: །མི་གང་སྟོང་ལ་སེམས་པར་བྱེད་འདོད་པ།
en: A person who wants to think about emptiness

source: །བསམ་ཡས་ཀུན་ལ་ཕྱིར་ཞིང་སེམས་པ་ཡིན།
en: Finds it all the more inconceivable.

source: །མིག་ནི་ཐམས་ཅད་ལྡན་ན་མཐོང་འགྱུར་ཏེ།
en: “When all conditions are right, the eye sees.

source: །མིག་གིས་གཟུགས་རྣམས་མཐོང་བ་གང་ཡིན་པའང་།
en: But forms that the eye normally sees

source: །མཚན་མོ་རྐྱེན་རྣམས་མེད་ན་མཐོང་མི་འགྱུར། །དེ་ཕྱིར་ལྡན་དང་བྲལ་བ་རྣམ་རྟོག་ཡིན།
en: Cannot be seen at night or when conditions are not right. Thus the presence or absence of conditions are concepts.

source: །མིག་ནི་སྣང་ལས་བརྟེན་ཏེ་ཡིད་འོང་དང་། །ཡིད་དུ་མི་འོང་སྣ་ཚོགས་གཟུགས་མཐོང་བས།
en: “In dependence on light, the eye sees Various forms both pleasing and unpleasant.

source: །དེ་ལྟར་ལྡན་ལས་བརྟེན་ཏེ་མཐོང་བས་ན།
en: Since it sees depending on the right conditions,

source: །དེ་ཕྱིར་མིག་གིས་ནམ་ཡང་མཐོང་བ་མེད།
en: The eye in fact never sees.

source: །ཡིད་དུ་འོང་བའི་སྒྲ་གྲག་གང་ཡིན་པ།
en: “Pleasant sounds that are heard

source: །དེ་ཡང་ནམ་ཡང་ནང་དུ་ཞུགས་པ་མེད།
en: Never actually enter the ear.

source: །དེར་འགྲོ་དམིགས་སུ་ཡོད་པ་མ་ཡིན་ཏེ།
en: Their entry is not observable;

source: །རྟོག་པའི་དབང་གིས་སྒྲ་རྣམས་བྱུང་བ་ཡིན།
en: Sound occurs through the force of concepts.

source: །ཆོས་རྣམས་འདི་དག་ཡི་གེ་སྒྲ་སྐད་ཀྱིས།
en: “All these phenomena have been explained

source: །གྲངས་དང་ཐ་སྙད་གདགས་པར་བསྟན་པ་ཡིན།
en: Using words to label and account for them.

source: །ཆོས་དང་ཆོས་མིན་ནམ་ཡང་ཡོད་མིན་ཡང་།
en: Although phenomena are neither present nor absent,

source: །སྐྱེ་བོ་བྱིས་པ་རྣམས་ལ་དེ་མི་སྣང་།
en: That is not how it appears to fools.

source: །སྦྱིན་པའི་བསྔགས་པ་འཇིག་རྟེན་ངས་བརྗོད་ཀྱང་།
en: “Although I have praised generosity to the world,

source: །སེར་སྣའི་ཆོས་དེའང་དམིགས་སུ་ཡོད་མ་ཡིན།
en: The phenomenon of avarice is not to be found.

source: །དེ་ལྟར་རྒྱལ་བའི་ཆོས་རྣམས་བསམ་ཡས་ཏེ།
en: Similarly, the Conqueror’s qualities are inconceivable;

source: །དེ་ཡང་དམིགས་མེད་དེ་ཡང་མཐོང་བ་མེད།
en: They are also not found and not seen.

source: །ཚུལ་ཁྲིམས་བྱ་བ་དག་པ་ངས་བཤད་ཀྱང་།
en: “Although I have taught pure ethical discipline,

source: །འཚལ་པའི་ཚུལ་ཁྲིམས་མཁའ་ལ་ལག་པ་བཞིན།
en: Ethical infractions are like a hand in space.

source: །ཚུལ་ཁྲིམས་ངན་པ་ཐམས་ཅད་མཁའ་འདྲ་སྟེ། །གང་དག་ཚུལ་བཟང་དེ་ཡང་དེ་དང་འདྲ།
en: All bad ethical discipline is like space, And so too is proper ethical discipline.

source: །བཟོད་པ་གྱ་ནོམ་ང་ཡིས་བཤད་བྱས་ཀྱང་།
en: “Although I have explained the excellence of patience,

source: །དེ་ཡི་རང་བཞིན་ནམ་ཡང་མཐོང་བ་མེད།
en: Its essence can never be seen.

source: །འདི་ན་ཆོས་འགའ་འང་འཁྲུག་པ་ཡོད་མིན་ཡང་།
en: Even though there is no phenomenon to be upset by,

source: །བཟོད་པ་དེ་ཡང་རྒྱལ་བས་རབ་ཏུ་བཤད།
en: The Conqueror has explained patience. “I have praised supreme wakefulness,

source: །ཉིན་མཚན་བག་ཡོད་བྱ་ཕྱིར་ང་ཡིས་ནི། །མི་ཉལ་དམ་པ་བསྔགས་པ་བརྗོད་བྱས་ཏེ།
en: For the purpose of remaining vigilant day and night.

source: །བསྐལ་པ་བརྒྱ་སྙེད་བརྩོན་འགྲུས་བསྐྱེད་བྱས་ཀྱང་།
en: Although one may exert oneself for hundreds of eons,

source: །འཕེལ་བར་མི་འགྱུར་ཟད་པ་ཡོད་མ་ཡིན།
en: Nothing increases and nothing diminishes.

source: །བསམ་གཏན་རྣམ་ཐར་ཏིང་འཛིན་གྱ་ནོམ་པའི།
en: “Beings have been taught the excellence of meditation, liberation, and samādhi,

source: །ཇི་བཞིན་སྒོ་དག་འགྲོ་ལ་བསྟན་བྱས་ཏེ།
en: As well as their points of entry.

source: །འདི་ལ་ཆོས་འགའ་འང་ཟད་པ་ཡོད་མིན་ཡང་།
en: Although there is no end to the doctrines they contain,

source: །དེ་དག་ཆ་ཤས་ཕྱེ་སྟེ་རབ་ཏུ་བསྟན།
en: I have taught them after determining their sections.

source: །ཤེས་རབ་ཆོས་རྣམས་ཤེས་པར་གྱིས་ཤིག་ཅེས།
en: “Stating that phenomena must be understood through wisdom,

source: །ཤེས་རབ་ལྷག་མཐོང་བློ་གྲོས་ངས་བསྟན་ཀྱང་།
en: I have taught on wisdom, insight, and the intellect.

source: །རང་བཞིན་རང་བཞིན་མེད་པ་ནམ་དུ་ཡང་།
en: And yet, nature and its lack can never be understood,

source: །ཤེས་པར་མི་ནུས་དེ་ཡང་ངེས་པར་བསྟན། །རབ་དབེན་ཆོག་ཤེས་སྦྱངས་ལ་དགའ་གྱིས་ཤེས།
en: But it is still necessary to teach them.

source: །དཀའ་ཐུབ་ངན་པ་འཇིག་རྟེན་ངས་བཤད་ཀྱང་།
en: “I have taught the world that asceticism is bad, Saying, ‘Take delight in cultivating isolation and contentment!’

source: །ཆོས་ཤེས་ཡོངས་སུ་མི་འཐོབ་གང་ཡིན་པ།
en: Anything that cannot be attained through contentment

source: །ཆོས་དེ་འདི་ན་དམིགས་སུ་ཡོད་མ་ཡིན།
en: Is not to be found in this Dharma.

source: །སེམས་དམྱལ་འཇིགས་པ་ང་ཡིས་བསྟན་བྱས་ཏེ།
en: “I have taught about the frightening hells

source: །སེམས་ཅན་སྟོང་ཕྲག་དུ་མ་སྐྱོ་བྱས་ཀྱང་།
en: That terrify many thousands of beings.

source: །གང་དག་ཤི་འཕོས་ངན་སོང་དྲག་འགྲོ་བའི། །འགྲོ་བ་དེ་དག་ནམ་ཡང་ཡོད་མ་ཡིན།
en: And yet, there is no one who, upon death,

source: །གང་དག་རལ་གྲི་མདའ་ཆེན་མཚོན་འབྱིན་པའི།
en: Takes a terrifying rebirth.

source: །གནོད་པ་བྱེད་པ་ཡོད་པ་མ་ཡིན་ཏེ།
en: “There is no one who inflicts harm With a sword, a spear, or a blade.

source: །རྟོག་པའི་དབང་གིས་ངན་སོང་དེ་དག་ན།
en: It is through the power of concepts that in those lower realms

source: །ལུས་ལ་འབབ་མཐོང་དེ་ན་མཚོན་ཆ་མེད།
en: Nonexistent weapons are seen to fall upon the body. “There is no one who has made

source: །སྣ་ཚོགས་ཡིད་དགའ་མེ་ཏོག་ཁ་བྱེ་ཞིང་།
en: The various delightful, blossoming flowers

source: །གསེར་གྱི་ཁང་མཆོག་འབར་བ་ཡིད་འོང་བ། །འདི་ན་དེ་ལའང་བྱེད་པ་འགའ་མེད་དེ།
en: And pleasant, radiant golden palaces;

source: །དེ་དག་རྟོག་པའི་དབང་གིས་གཞག་པ་ཡིན།
en: They manifest through the power of concepts.

source: །རྟོག་པའི་དབང་གིས་འཇིག་རྟེན་རྣམ་བརྟགས་ཏེ།
en: “The world is fabricated by concepts;

source: །འདུ་ཤེས་འཛིན་པས་བྱིས་པ་རྣམ་པར་ཕྱེ།
en: Fools discriminate by clinging to ideas.

source: །འཛིན་དང་འཛིན་མེད་དེ་ཡང་འབྱུང་མིན་ཏེ།
en: Clinging and non-clinging do not exist;

source: །ཡོངས་སུ་རྟོག་པ་སྒྱུ་མ་སྨིག་རྒྱུ་བཞིན། །འགྲོ་དོན་བྱང་ཆུབ་ཕྱིར་ནི་སེམས་བསྐྱེད་ཅེས།
en: Fabrications are like illusions and mirages.

source: །སྤྱོད་མཆོག་ཁྱད་པར་འཕགས་པ་བསྟན་བྱས་ཀྱང་།
en: “Although I have taught exalted, supreme conduct, Saying, ‘Generate the mind of awakening for the benefit of beings!’

source: །བྱང་ཆུབ་ནམ་ཡང་དམིགས་སུ་ཡོད་མིན་ཏེ།
en: There is no awakening to be observed;

source: །འདོད་པ་གང་ཡིན་དེ་ཡང་ཡོད་མ་ཡིན།
en: That which is desired simply does not exist.

source: །སེམས་ནི་རང་བཞིན་འོད་གསལ་རྣམ་དག་ཅིང་།
en: “I have taught that the mind is luminous and pure by nature,

source: །རྡུལ་མེད་རྡུལ་བྲལ་དྲི་མ་མེད་པར་གསུངས།
en: That it is dustless, free of dust, and stainless.

source: །བྱིས་པ་ཡོད་པ་མིན་ལ་རྣམ་རྟོག་པ།
en: Fools conceptualize that which is nonexistent,

source: །ཆགས་འགྱུར་སྡང་བར་འགྱུར་ཞིང་རྨོངས་པར་འགྱུར།
en: And so they develop desire, anger, and delusion.

source: །མཉམ་གཞག་གྱ་ནོམ་ཆོས་ནི་ཐོབ་གྱུར་ན།
en: “When the sublime Dharma of meditative equanimity is attained,

source: །འདོད་ཆགས་ཡོད་མིན་སྡང་མེད་རྨོངས་པའང་མེད།
en: Desire, anger, and delusion do not exist.

source: །འདོད་ཆགས་བྲལ་ཞིང་རྣམ་པར་གྲོལ་བའི་ཆོས།
en: Phenomena, which are free of desire and liberated,

source: །ཀུན་གཞིར་མ་གྱུར་མྱ་ངན་འདས་པ་འཐོབ།
en: Do not serve as the basis of anything, and nirvāṇa is attained.

source: །མཁའ་འདྲའི་ཆོས་རྣམས་འདི་དག་ཤེས་གྱུར་ན།
en: “Those who understand these space-like phenomena

source: །ཞིང་བརྒྱ་རྣམས་སུ་ཐོགས་མེད་འགྲོ་འགྱུར་ཞིང་།
en: Can go to hundreds of realms unhindered.

source: །དེ་དག་ཡིད་ཀྱང་ཆགས་པ་མེད་འགྱུར་བས།
en: Since their mind is free of desire,

source: །དེ་ཕྱིར་ཐོགས་མེད་ལམ་ནི་བསྐྱེད་པར་གྱིས།
en: They must cultivate the path without obstruction.

source: །བསྐལ་པ་བརྒྱ་ཕྲག་མང་པོར་སྤྱོད་བྱས་ཤིང་།
en: “Although one has practiced for hundreds of eons

source: །སེམས་ཅན་བརྒྱ་ཕྲག་མཐའ་ཡས་གྲོལ་བྱས་ཀྱང་།
en: And liberated countless beings,

source: །ནམ་ཡང་སེམས་ཅན་དམིགས་སུ་ཡོད་མིན་ཞིང་།
en: There never were beings;

source: །ཟད་པའང་ཡོད་མིན་མཐའ་ཡས་གྱུར་པའང་མེད།
en: They neither decrease nor proliferate endlessly.

source: །ཇི་ལྟར་སྒྱུ་མ་མཁན་གྱིས་འཇིག་རྟེན་ན།
en: “A magician can conjure

source: །སེམས་ཅན་བརྒྱ་ཕྲག་མང་པོ་སྤྲུལ་བྱས་ཏེ།
en: Hundreds of beings into the world

source: །སྤྲུལ་པ་དེ་དག་ཐམས་ཅད་བསད་གྱུར་ཀྱང་།
en: And then kill all those emanations

source: །སྒྱུ་མ་དེ་དག་བསད་པ་ཡོད་མིན་ལྟར།
en: Without any illusions being killed.

source: །འགྲོ་བ་འདི་ཀུན་སྒྱུ་མའི་རང་བཞིན་ཏེ།
en: “Similarly, all beings have an illusory nature,

source: །འདི་ལ་མཐའ་ནི་ནམ་ཡང་དམིགས་སུ་མེད།
en: And their extent is wholly unknown.

source: །གང་དག་དེ་ལྟར་མཐའ་ཡས་མོས་བྱས་པ།
en: Those who invested themselves in this infinite multitude

source: །དེ་དག་འཇིག་རྟེན་ན་ནི་ཚོར་བ་མེད།
en: Are insensitive to the world.

source: །གང་དག་རང་བཞིན་མེད་ཆོས་འདི་ཤེས་པ།
en: “Those who know that phenomena lack inherent nature

source: །དཔའ་བོ་དེ་དག་འཇིག་རྟེན་མྱ་ངན་འདས།
en: Are heroes who found nirvāṇa in the world.

source: །འདོད་པའི་ཡོན་ཏན་སྤྱོད་ཀྱང་ཆགས་མེད་ཅིང་།
en: Although they enjoy sense pleasures, they are unattached;

source: །ཆགས་པ་རྣམས་སྤངས་སེམས་ཅན་འདུལ་བར་བྱེད།
en: They forsake attachments and discipline beings.

source: །འདི་ན་སེམས་ཅན་འགའ་མེད་སྲོག་མེད་ཀྱང་།
en: “Although there are neither beings nor living things here,

source: །མི་དབང་རྣམས་ནི་སེམས་ཅན་ཕན་པ་མཛད།
en: The lords of men work for the welfare of beings.

source: །སེམས་ཅན་ཡོད་མ་ཡིན་ཡང་དོན་མཛད་པ།
en: They benefit beings, even though beings do not exist.

source: །དེ་དག་རྣམས་ཀྱི་དེ་ནི་དཀའ་བ་ཆེ།
en: For them, this is an arduous task.

source: །ཇི་ལྟར་ཆང་བ་བཅངས་ཏེ་བྱིས་པ་ལ།
en: “If one shows a closed hand to a child

source: །སྟོན་ཅིང་ལ་དུ་ཡོད་ཅེས་བརྗོད་བྱས་ནས། །དེ་ཡིས་ཆང་བ་སྟོང་པ་མཐོང་ནས་ནི།
en: And says ‘Here is a laḍḍu,’

source: །བྱིས་པ་དེ་ནི་ཆོ་ངེས་ངུ་བ་ལྟར།
en: The child will cry Upon seeing an empty hand.

source: །དེ་བཞིན་སངས་རྒྱས་བསམ་གྱིས་མི་ཁྱབ་པ།
en: “Likewise, the inconceivable buddhas,

source: །སེམས་ཅན་ཚུལ་ལ་མཁས་ཤིང་མཁྱེན་པ་རྣམས།
en: Who know and are proficient in the ways of beings,

source: །ཆོས་རྣམས་འདི་དག་གསོབ་གསོག་མཁྱེན་གྱུར་ནས།
en: Realize that all phenomena are deceptive
